<?php

namespace Database\Seeders;

use App\Models\Court;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CourtSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Court::create([
            'name' => 'ملعب احمد الزوي',
            'description' => 'هذا الملعب هو واحد من أفضل مرافق كرة القدم الصغيرة في المنطقة. يقع مباشرة مقابل مول اوف بنغازي، مما يجعله مكانًا مثاليًا للاعبين الراغبين في ممارسة الرياضة بعد التسوق. تتميز تربته المثالية وإضاءته الجيدة بتوفير تجربة لعب رائعة للجميع.',
            'address' => 'سي فرج',
            'price_per_hour' => 30,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب السد',
            'description' => 'هذا الملعب الرائع هو المكان المفضل للاعبي كرة القدم الصغيرة في المنطقة. يقع مقابل نادي السد الشهير، مما يجعله مكانًا مثاليًا للتدرب واللعب مع أصدقائك. تتميز تربته العشبية بالجودة العالية وتصميمه المذهل بتوفير تجربة لا تُنسى للجميع.',
            'address' => 'الكيش',
            'price_per_hour' => 40,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب فينيسيا',
            'description' => 'هذا الملعب الرائع هو واحد من أكثر مرافق كرة القدم الصغيرة شعبية في المنطقة. يقع على شارع حلواني الفايدي، مما يجعله مكانًا مثاليًا للاستمتاع بلعب كرة القدم الصغيرة في جو مريح وهادئ. تتميز إضاءته الممتازة وأرضيته العشبية بتوفير تجربة لا مثيل لها للاعبين.',
            'address' => 'فينيسيا',
            'price_per_hour' => 50,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب قاريونس',
            'description' => 'هذا الملعب المتميز هو المكان المثالي لممارسة كرة القدم الصغيرة في المنطقة. يتسع لـ 6 لاعبين في الفريق الواحد، مما يجعله مكانًا رائعًا للمباريات الحماسية والتنافسية. تتميز تربته العالية الجودة وإضاءته المثالية بتوفير تجربة لا تُنسى للجميع.',
            'address' => 'قاريونس',
            'price_per_hour' => 55,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب دبي',
            'description' => 'هذا الملعب الرائع هو واحد من أكثر مرافق كرة القدم الصغيرة تميزًا في المنطقة. يتسع لـ 7 لاعبين في الفريق الواحد، مما يجعله مكانًا مثاليًا للمباريات الحماسية والتنافسية. تتميز أرضيته العشبية المذهلة وإضاءته المثالية بتوفير تجربة لا مثيل لها للاعبين.',
            'address' => 'دبي',
            'price_per_hour' => 60,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب أكاديمية النجم',
            'description' => 'هذا الملعب الرائع هو المكان المفضل للاعبي كرة القدم الصغيرة في المنطقة. يتسع لـ 7 لاعبين في الفريق الواحد، مما يجعله مكانًا مثاليًا للمباريات الحماسية والتنافسية. تتميز تربته العالية الجودة وإضاءته المثالية بتوفير تجربة لا تُنسى للجميع.',
            'address' => 'الماجوري',
            'price_per_hour' => 70,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب فينيسيا',
            'description' => 'هذا الملعب الرائع هو واحد من أكثر مرافق كرة القدم الصغيرة شعبية في المنطقة. يقع على شارع حلواني الفايدي، مما يجعله مكانًا مثاليًا للاستمتاع بلعب كرة القدم الصغيرة في جو مريح وهادئ. تتميز إضاءته الممتازة وأرضيته العشبية بتوفير تجربة لا مثيل لها للاعبين.',
            'address' => 'فينيسيا',
            'price_per_hour' => 75,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب الجوهرة',
            'description' => 'هذا الملعب المتميز هو المكان المثالي لممارسة كرة القدم الصغيرة في المنطقة. يتسع لـ 6 لاعبين في الفريق الواحد، مما يجعله مكانًا رائعًا للمباريات الحماسية والتنافسية. تتميز تربته العالية الجودة وإضاءته المثالية بتوفير تجربة لا تُنسى للجميع.',
            'address' => 'قاريونس',
            'price_per_hour' => 70,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب الهلال',
            'description' => 'هذا الملعب الرائع هو واحد من أكثر مرافق كرة القدم الصغيرة تميزًا في المنطقة. يتسع لـ 8 لاعبين في الفريق الواحد، مما يجعله مكانًا مثاليًا للمباريات الحماسية والتنافسية. تتميز أرضيته العشبية المذهلة وإضاءته المثالية بتوفير تجربة لا مثيل لها للاعبين.',
            'address' => 'البركة',
            'price_per_hour' => 80,
            'image' => '',
        ]);
        Court::create([
            'name' => 'ملعب الملك',
            'description' => 'هذا الملعب الرائع هو المكان المفضل للاعبي كرة القدم الصغيرة في المنطقة. يتسع لـ 8 لاعبين في الفريق الواحد، مما يجعله مكانًا مثاليًا للمباريات الحماسية والتنافسية. تتميز تربته العالية الجودة وإضاءته المثالية بتوفير تجربة لا تُنسى للجميع.',
            'address' => 'بلعون',
            'price_per_hour' => 85,
            'image' => '',
        ]);
    }

}