<style>
.font-cairo {
  font-family: "Cairo", sans-serif;
}

.rtl {
    direction: rtl;
    text-align: right;
}
</style>
<script setup>
import { Link, usePage } from '@inertiajs/vue3';
import NavBar from './NavBar.vue'
import Footer from './Footer.vue';
</script>
<template>
    <NavBar></NavBar>
    <section class="bg-white dark:bg-white-900 rtl">
      <div class="py-8 px-4 mx-auto max-w-screen-xl lg:py-16 lg:px-6">
        <div class="max-w-screen-lg text-dark-500 sm:text-lg dark:text-gray-400">
          <h2 class="mb-4 text-4xl tracking-tight font-cairo text-gray-900 dark:text-green-700">شروط الخدمة</h2>
          <p class="mb-4 text-xl font-cairo">1. مقدمة
            تحكم هذه الشروط والأحكام ("الشروط") وصولك واستخدامك لموقعنا الإلكتروني وتطبيقاتنا للجوال والخدمات ذات الصلة (يُشار إليها مجتمعة باسم "الخدمة"). من خلال الوصول أو استخدام الخدمة، فإنك توافق على الالتزام بهذه الشروط وبسياسة الخصوصية الخاصة بنا. إذا لم توافق على هذه الشروط، فيجب عليك عدم استخدام الخدمة.</p>
          <p class="mb-4 font-cairo">2. الأهلية
            تم تصميم الخدمة للأفراد الذين تبلغ أعمارهم 13 عامًا على الأقل. من خلال استخدام الخدمة، فإنك تُقر وتضمن أنك تبلغ من العمر 13 عامًا على الأقل. إذا كنت تقل عن 18 عامًا، فيمكنك استخدام الخدمة فقط تحت إشراف والد أو ولي أمر قانوني يوافق على الالتزام بهذه الشروط.</p>
          <p class="mb-4 font-cairo">3. استخدامك للخدمة
            الامتثال للقوانين: توافق على استخدام الخدمة بما يتوافق مع جميع القوانين واللوائح والأنظمة المعمول بها.
            الأنشطة المحظورة: توافق على عدم المشاركة في أي أنشطة غير قانونية أو سيئة السلوك أثناء استخدام الخدمة، بما في ذلك على سبيل المثال لا الحصر ما يلي: (i) انتهاك حقوق الملكية الفكرية للآخرين؛ (ii) نشر أو إرسال أي محتوى غير قانوني أو ضار أو تهديدي أو مسيء أو مضايق أو مشهر به أو غير ذلك من المحتوى غير المرغوب فيه؛ (iii) التدخل في أو تعطيل الخدمة أو الخوادم أو الشبكات المتصلة بالخدمة؛ و (iv) محاولة الوصول غير المصرح به إلى الخدمة أو الحسابات الأخرى أو أنظمة الكمبيوتر أو الشبكات المتصلة بالخدمة.
            محتوى المستخدم: أي محتوى تقوم بتحميله أو إرساله أو نشره على الخدمة ("محتوى المستخدم") يظل لك. ومع ذلك، من خلال تحميل أو إرسال أو نشر محتوى المستخدم، فإنك تمنحنا ترخيصًا عالميًا وغير حصري وخالٍ من الرسوم لاستخدام وإعادة إنتاج وتوزيع وعرض محتوى المستخدم في ما يتعلق بتشغيل وتحسين الخدمة.</p>
          <p class="mb-4 font-cairo">4. الملكية الفكرية
            الخدمة وجميع محتوياتها وميزاتها ووظائفها مملوكة لـ [ملعبنا] أو مرخصيها ومحمية بموجب قوانين حقوق النشر والعلامات التجارية وغيرها من حقوق الملكية الفكرية.</p>
          
        </div>
      </div>
    </section>
    <Footer></Footer>
  </template>